a = 24
b = 13
c = 7
a = a + b
print(a)  # 此时的a被重新赋予了a+b的值，即24+13=37
print(24+13)
a += c
print(a)  # 此时的a被重新赋予了在重新赋值后的37+c的值，即37+7=44
print(37+7)
a -= b
print(a)  # 此时的a被重新赋予了在重新赋值后的44-b的值，即44-13=31
print(44-13)
a *= b
print(a)  # 此时的a被重新赋予了在重新赋值后的31*b的值，即31*13=403
print(31*13)
a /= b
print(a)  # 此时的a被重新赋予了在重新赋值后的403/b的值，即403/13=31
print(403/13)
a %= c
print(a)  # 此时的a被重新赋予了在重新赋值后的31%c的值，即31%7=3
print(31%7)
a **= c
print(a)  # 此时的a被重新赋予了在重新赋值后的3的c次幂的值，即3**7=2187
print(3**7)
a //= c
print(a)  # 此时的a被重新赋予了在重新赋值后的2187//c的值，即2187//7=44
print(2187//7)