
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>L5变量类型初步 · 吹花小筑工作室</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="賈誌翔">
        
        
    
    <link rel="stylesheet" href="../../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-yahei/yahei.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-advanced-emoji/emoji-website.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-anchor-navigation-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-prism/prism-tomorrow.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../编码规范、标识符、关键字/L6编码规范、标识符、关键字.md" />
    
    
    <link rel="prev" href="../L4注释的使用/注释的使用.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"buttons":[{"user":"jiaxiaochu","repo":"python-data-analysis","type":"star","size":"small"}]};
    </script>

    
        <link rel="shortcut icon" href='../../../assets/images/color_cat.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='../../../assets/images/color_cat.ico' type="image/x-icon">
    
    
        <link rel="apple-touch-icon" href='../../../assets/images/color_cat.jpg'>
    
    
        
        <link rel="apple-touch-icon" sizes="120x120" href="../../../assets/images/color_cat.jpg">
        
        <link rel="apple-touch-icon" sizes="180x180" href="../../../assets/images/color_cat.jpg">
        
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
    

    

    
        
        <li class="header">Part I - Python基础语法(一)</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../../">
            
                <a href="../../../">
            
                    
                        <b>1.1.</b>
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../L1认识Python/">
            
                <a href="../L1认识Python/">
            
                    
                        <b>1.2.</b>
                    
                    Python基础
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../L1认识Python/遇见Python.html">
            
                <a href="../L1认识Python/遇见Python.html">
            
                    
                        <b>1.2.1.</b>
                    
                    L1遇见Python
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../L2第一个Python程序/第一个Python程序.html">
            
                <a href="../L2第一个Python程序/第一个Python程序.html">
            
                    
                        <b>1.2.2.</b>
                    
                    L2第一个Python程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../L3输入输出/输入输出.html">
            
                <a href="../L3输入输出/输入输出.html">
            
                    
                        <b>1.2.3.</b>
                    
                    L3输入输出
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="../L4注释的使用/注释的使用.html">
            
                <a href="../L4注释的使用/注释的使用.html">
            
                    
                        <b>1.2.4.</b>
                    
                    L4注释的使用
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.5" data-path="变量类型初步.html">
            
                <a href="变量类型初步.html">
            
                    
                        <b>1.2.5.</b>
                    
                    L5变量类型初步
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="../编码规范、标识符、关键字/L6编码规范、标识符、关键字.md">
            
                <span>
            
                    
                        <b>1.2.6.</b>
                    
                    L6编码规范、标识符、关键字
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="../L7运算符初步/运算符初步.html">
            
                <a href="../L7运算符初步/运算符初步.html">
            
                    
                        <b>1.2.7.</b>
                    
                    L7运算符初步
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../../.." >L5变量类型初步</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <div id="anchor-navigation-ex-navbar"><i class="fa fa-navicon"></i><ul><li><span class="title-icon "></span><a href="#&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x521D;&#x6B65;"><b>1. </b>&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x521D;&#x6B65;</a></li><ul><li><span class="title-icon "></span><a href="#&#x53D8;&#x91CF;"><b>1.1. </b>&#x53D8;&#x91CF;</a></li><li><span class="title-icon "></span><a href="#&#x6570;&#x5B57;&#x7C7B;&#x578B;"><b>1.2. </b>&#x6570;&#x5B57;&#x7C7B;&#x578B;</a></li><ul><li><span class="title-icon "></span><a href="#&#x6574;&#x6570;int"><b>1.2.1. </b>&#x6574;&#x6570;(int)</a></li><li><span class="title-icon "></span><a href="#&#x6D6E;&#x70B9;&#x6570;"><b>1.2.2. </b>&#x6D6E;&#x70B9;&#x6570;</a></li><li><span class="title-icon "></span><a href="#&#x590D;&#x6570;"><b>1.2.3. </b>&#x590D;&#x6570;</a></li></ul><li><span class="title-icon "></span><a href="#&#x5B57;&#x7B26;&#x4E32;&#x7C7B;&#x578B;"><b>1.3. </b>&#x5B57;&#x7B26;&#x4E32;&#x7C7B;&#x578B;</a></li><ul><li><span class="title-icon "></span><a href="#&#x8F6C;&#x4E49;&#x5B57;&#x7B26;"><b>1.3.1. </b>&#x8F6C;&#x4E49;&#x5B57;&#x7B26;</a></li></ul><li><span class="title-icon "></span><a href="#&#x5E03;&#x5C14;&#x7C7B;&#x578B;"><b>1.4. </b>&#x5E03;&#x5C14;&#x7C7B;&#x578B;</a></li><li><span class="title-icon "></span><a href="#&#x7C7B;&#x578B;&#x8F6C;&#x6362;"><b>1.5. </b>&#x7C7B;&#x578B;&#x8F6C;&#x6362;</a></li></ul></ul></div><a href="#&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x521D;&#x6B65;" id="anchorNavigationExGoTop"><i class="fa fa-arrow-up"></i></a><h1 id="&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x521D;&#x6B65;"><a name="&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x521D;&#x6B65;" class="anchor-navigation-ex-anchor" href="#&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x521D;&#x6B65;"><i class="fa fa-link" aria-hidden="true"></i></a>1. &#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x521D;&#x6B65;</h1>
<h2 id="&#x53D8;&#x91CF;"><a name="&#x53D8;&#x91CF;" class="anchor-navigation-ex-anchor" href="#&#x53D8;&#x91CF;"><i class="fa fa-link" aria-hidden="true"></i></a>1.1. &#x53D8;&#x91CF;</h2>
<p>&#x5728;Python&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x53D8;&#x91CF;&#x66F4;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x201C;&#x540D;&#x5B57;&#x201D;&#xFF0C;&#x4E00;&#x4E2A;&#x201C;&#x6807;&#x7B7E;&#x201D;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E5F;&#x6709;&#x5C06;&#x53D8;&#x91CF;&#x6BD4;&#x4F5C;&#x201C;&#x5BB9;&#x5668;&#x201D;&#x7684;&#x3002;&#x8FD9;&#x91CC;&#xFF0C;&#x4E0D;&#x7BA1;&#x54EA;&#x79CD;&#x8BF4;&#x6CD5;&#xFF0C;&#x90FD;&#x5BF9;&#xFF0C;&#x53EA;&#x662F;&#x4FA7;&#x91CD;&#x70B9;&#x4E0D;&#x540C;&#x3002;&#x53D8;&#x91CF;&#xFF0C;&#x5728;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x62BD;&#x8C61;&#x6982;&#x5FF5;&#xFF0C;&#x5206;&#x522B;&#x5177;&#x6709;&#x4E00;&#x4E0B;&#x4E09;&#x4E2A;&#x57FA;&#x672C;&#x5C5E;&#x6027;&#xFF1A;1&#x3001;&#x53D8;&#x91CF;&#x540D;&#x79F0;&#x3002;2&#x3001;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x3002;3&#x3001;&#x53D8;&#x91CF;&#x503C;&#x3002;&#x524D;&#x9762;&#x7684;&#x201C;&#x540D;&#x79F0;&#x201D;&#x4E0E;&#x201C;&#x6807;&#x7B7E;&#x201D;&#x7684;&#x8BF4;&#x6CD5;&#xFF0C;&#x66F4;&#x4FA7;&#x91CD;&#x5F3A;&#x8C03;&#x53D8;&#x91CF;&#x7684;&#x540D;&#x79F0;&#x5C5E;&#x6027;&#x3002;&#x800C;&#x201C;&#x5BB9;&#x5668;&#x201D;&#x5219;&#x66F4;&#x4FA7;&#x91CD;&#x5F3A;&#x8C03;&#x53D8;&#x91CF;&#x7684;&#x7C7B;&#x578B;&#x4E0E;&#x503C;&#x7684;&#x5C5E;&#x6027;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x89C2;&#x5BDF;&#x53D8;&#x91CF;&#x65F6;&#xFF0C;&#x4E00;&#x822C;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x5728;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#x65F6;&#x7684;&#x6837;&#x5B50;&#x3002;&#x90A3;&#x4E48;&#x53C8;&#x5982;&#x4F55;&#x6765;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5462;&#xFF1F;</p>
<p>&#x5728;Python&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x201C;=&#x201D;&#x7B49;&#x53F7;&#x6765;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<blockquote>
<p>&#x53D8;&#x91CF;&#x540D; = &#x53D8;&#x91CF;&#x503C;</p>
</blockquote>
<p>&#x5728;&#x5E94;&#x7528;&#x4E2D;&#x5219;&#x4E3A;&#xFF1A;</p>
<pre class="language-"><code class="lang-python">age  <span class="token operator">=</span> <span class="token number">18</span>
</code></pre>
<p>&#x5C31;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x628A;&#x6211;&#x4EEC;&#x7684;&#x5E74;&#x9F84;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#x503C;&#xFF0C;&#x901A;&#x8FC7;&#x4E2D;&#x95F4;&#x7684;&#x201C;=&#x201D;&#x7B49;&#x53F7;&#xFF0C;&#x653E;&#x5728;&#x4E86;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x540D;&#x79F0;&#x4E3A;&#x201C;age&#x201D;&#x3001;&#x201C;a-g-e&#x201D;&#x7684;&#x5BB9;&#x5668;&#x4E2D;&#x53BB;&#x4E86;&#x3002;&#x5373;&#x6211;&#x4EEC;&#x7ED9;&#x4E00;&#x4E2A;&#x540D;&#x5B57;&#x4E3A;&#x201C;age&#x201D;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x8D4B;&#x4E86;&#x4E00;&#x4E2A;&#x4E3A;&#x201C;18&#x201D;&#x7684;&#x503C;&#xFF1B;&#x6211;&#x4EEC;&#x4E5F;&#x5B9A;&#x4E49;or&#x58F0;&#x660E;&#x4E86;&#x4E00;&#x4E2A;&#x503C;&#x4E3A;&#x201C;18&#x201D;&#xFF0C;&#x540D;&#x5B57;&#x4E3A;&#x201C;age&#x201D;&#x7684;&#x53D8;&#x91CF;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x6709;&#x53D8;&#x91CF;&#x503C;&#x5462;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#x53C8;&#x8981;&#x5C06;&#x53D8;&#x91CF;&#x503C;&#x653E;&#x8FDB;&#x4E00;&#x4E2A;&#x5E26;&#x6709;&#x201C;&#x540D;&#x5B57;&#x201D;&#x548C;&#x201C;&#x6807;&#x7B7E;&#x201D;&#x7684;&#x5BB9;&#x5668;&#x4E2D;&#x53BB;&#x5462;&#xFF1F;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x8FD8;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x624B;&#x673A;&#x7B49;&#x4E00;&#x5207;&#x667A;&#x80FD;&#x8BBE;&#x5907;&#x7684;&#x8FD0;&#x884C;&#xFF0C;&#x4EE5;&#x53CA;&#x6211;&#x4EEC;&#x4E00;&#x5207;&#x5728;&#x8FD9;&#x4E9B;&#x8BBE;&#x5907;&#x4E0A;&#x6240;&#x5B9E;&#x73B0;&#x7684;&#x4E00;&#x5207;&#x529F;&#x80FD;&#x548C;&#x64CD;&#x4F5C;&#x3002;&#x4F8B;&#x5982;&#xFF1A;&#x53D1;&#x5FAE;&#x4FE1;&#xFF0C;&#x770B;&#x89C6;&#x9891;&#xFF0C;&#x73A9;&#x6E38;&#x620F;&#xFF0C;&#x6570;&#x636E;&#x5206;&#x6790;&#xFF0C;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#xFF0C;&#x7B49;&#x7B49;&#xFF0C;&#x90FD;&#x662F;&#x9488;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x548C;&#x4FE1;&#x606F;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x800C;&#x6570;&#x636E;&#x548C;&#x4FE1;&#x606F;&#xFF0C;&#x90FD;&#x662F;&#x4EE5;&#x503C;&#xFF08;value&#xFF09;&#x7684;&#x5F62;&#x5F0F;&#x5B58;&#x5728;&#x7684;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x5E74;&#x9F84;&#x7684;&#x6570;&#x636E;&#xFF08;&#x4FE1;&#x606F;&#xFF09;&#x5B83;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x503C;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x6570;&#x5B57;&#xFF1B;&#x6211;&#x4EEC;&#x7684;&#x540D;&#x5B57;&#x7684;&#x6570;&#x636E;&#xFF08;&#x4FE1;&#x606F;&#xFF09;&#x5B83;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x503C;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x600E;&#x4E48;&#x628A;&#x8FD9;&#x4E9B;&#x5177;&#x4F53;&#x7684;&#x503C;&#xFF0C;&#x544A;&#x8BC9;&#x8BA1;&#x7B97;&#x673A;&#x5462;&#xFF1F;&#x53C8;&#x600E;&#x4E48;&#x8BA9;&#x8BA1;&#x7B97;&#x673A;&#x628A;&#x5B83;&#x77E5;&#x9053;&#x90A3;&#x4E9B;&#x503C;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x5462;&#xFF1F;&#x4E0D;&#x77E5;&#x9053;&#x5927;&#x5BB6;&#x8FD8;&#x8BB0;&#x4E0D;&#x8BB0;&#x5F97;&#xFF0C;&#x524D;&#x9762;&#x6211;&#x4EEC;&#x5728;&#x8BB2;&#x6CE8;&#x91CA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x7F16;&#x7801;&#x548C;&#x89E3;&#x7801;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x90A3;&#x4E48;&#x201C;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#x201D;or&#x201C;&#x58F0;&#x660E;&#x53D8;&#x91CF;&#x201D;&#x5C31;&#x662F;&#x5728;&#x628A;&#x6211;&#x4EEC;&#x7684;&#x201C;&#x503C;&#x201D;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#xFF0C;&#x6309;&#x7167;&#x8BA1;&#x7B97;&#x673A;&#x80FD;&#x591F;&#x89E3;&#x7801;&#x7684;&#x5F62;&#x5F0F;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#x3002;&#x6211;&#x4EEC;&#x628A;&#x6211;&#x4EEC;&#x7684;&#x503C;&#xFF0C;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x6709;&#x7279;&#x5B9A;&#x540D;&#x79F0;&#x7684;&#x5BB9;&#x5668;&#x91CC;&#xFF0C;&#x544A;&#x8BC9;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x6253;&#x5F00;&#x8FD9;&#x4E2A;&#x5BB9;&#x5668;&#xFF0C;&#x5C31;&#x89E3;&#x7801;&#x83B7;&#x5F97;&#x4E86;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x544A;&#x8BC9;&#x5B83;&#x7684;&#x503C;&#x4E86;&#xFF0C;&#x5E76;&#x4E14;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x901A;&#x8FC7;&#x6211;&#x4EEC;&#x7ED9;&#x8FD9;&#x4E2A;&#x5BB9;&#x5668;&#x6240;&#x8D77;&#x7684;&#x201C;&#x540D;&#x5B57;&#x201D;or&#x201C;&#x6807;&#x7B7E;&#x201D;&#xFF0C;&#x5373;&#x53D8;&#x91CF;&#x540D;&#x79F0;&#xFF0C;&#x544A;&#x8BC9;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x8FD9;&#x4E2A;&#x503C;&#x662F;&#x5173;&#x4E8E;&#x4EC0;&#x4E48;&#x7684;&#x503C;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E5F;&#x901A;&#x8FC7;&#xFF0C;&#x503C;&#x548C;&#x540D;&#x79F0;&#xFF0C;&#x4EE5;&#x53CA;&#x6709;&#x201C;=&#x201D;&#x7B49;&#x53F7;&#x53C2;&#x4E0E;&#x7684;&#x201C;&#x5B9A;&#x4E49;&#x201D;&#x4E0E;&#x201C;&#x58F0;&#x660E;&#x201D;&#x8FC7;&#x7A0B;&#xFF0C;&#x544A;&#x8BC9;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x8FD9;&#x4E2A;&#x503C;or&#x53D8;&#x91CF;&#x7684;&#x53D8;&#x91CF;&#x7C7B;&#x578B;or&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002;</p>
<p>&#x5C31;&#x8FD9;&#x6837;&#xFF0C;&#x5728;&#x8FD9;&#x4E9B;&#x88AB;&#x4EBA;&#x4EEC;&#x6309;&#x53D8;&#x91CF;&#x540D;&#x79F0;&#x88C5;&#x597D;&#x7684;&#x53D8;&#x8138;&#x503C;&#xFF0C;&#x88AB;&#x4F20;&#x9012;&#x6765;&#xFF0C;&#x4F20;&#x9012;&#x53BB;&#xFF0C;&#x5C31;&#x6784;&#x6210;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x667A;&#x80FD;&#x4E16;&#x754C;&#x3002;&#x6211;&#x4EEC;&#x628A;&#x4E00;&#x4E2A;&#x786E;&#x5B9A;&#x4E0B;&#x5355;&#x548C;&#x652F;&#x4ED8;&#x6210;&#x529F;&#x7684;&#x201C;&#x503C;&#x201D;&#x7ED9;&#x6DD8;&#x5B9D;&#x5356;&#x5BB6;&#xFF0C;&#x5B83;&#x4EEC;&#x628A;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x5546;&#x54C1;&#x7ED9;&#x6211;&#x4EEC;&#x5FEB;&#x9012;&#x5230;&#x5BB6;&#xFF1B;&#x6211;&#x4EEC;&#x628A;&#x9971;&#x542B;&#x7231;&#x610F;&#x548C;&#x60C5;&#x8C0A;&#x7684;&#x4FE1;&#x606F;&#x7684;&#x201C;&#x503C;&#x201D;&#x901A;&#x8FC7;&#x5FAE;&#x4FE1;&#x4F20;&#x9012;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x7231;&#x4EBA;&#x548C;&#x670B;&#x53CB;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x7231;&#x60C5;&#x548C;&#x53CB;&#x8C0A;&#x4E5F;&#x53D8;&#x70B9;&#x66F4;&#x52A0;&#x957F;&#x60C5;&#x548C;&#x6DF1;&#x6C89;&#xFF1B;&#x6211;&#x4EEC;&#x628A;&#x6211;&#x624B;&#x6307;&#x95F4;&#x5BF9;&#x82F1;&#x96C4;&#x7684;&#x64CD;&#x4F5C;&#x7684;&#x201C;&#x503C;&#x201D;&#x5728;&#x738B;&#x8005;&#x8363;&#x8000;&#x4E2D;&#x4F20;&#x9012;&#xFF0C;&#x4FBF;&#x5C31;&#x6210;&#x529F;&#x7684;&#x5BF9;&#x5BF9;&#x9762;&#x7684;&#x82F1;&#x96C4;a&#x51FA;&#x4E86;&#x6700;&#x540E;&#x4E00;&#x4E0B;&#xFF0C;&#x7ED9;&#x4E88;&#x6700;&#x540E;&#x4E00;&#x51FB;&#x5B8C;&#x6210;&#x4E94;&#x6740;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x53D8;&#x91CF;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x53D8;&#x91CF;&#x3002;&#x5728;&#x8BF4;&#x5B8C;&#xFF0C;&#x53D8;&#x91CF;&#x7684;&#x540D;&#x79F0;&#x4E0E;&#x503C;&#xFF0C;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x7684;&#x5B9A;&#x4E49;&#x4E0E;&#x8D4B;&#x503C;&#x3002;&#x6211;&#x4EEC;&#x518D;&#x6765;&#x8BF4;&#x8BF4;&#x5B83;&#x4EEC;&#x7684;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#x7C7B;&#x578B;&#x3002;</p>
<h2 id="&#x6570;&#x5B57;&#x7C7B;&#x578B;"><a name="&#x6570;&#x5B57;&#x7C7B;&#x578B;" class="anchor-navigation-ex-anchor" href="#&#x6570;&#x5B57;&#x7C7B;&#x578B;"><i class="fa fa-link" aria-hidden="true"></i></a>1.2. &#x6570;&#x5B57;&#x7C7B;&#x578B;</h2>
<p>&#x6211;&#x4EEC;&#x73A9;&#x6E38;&#x620F;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x91D1;&#x5E01;&#x662F;&#x7528;&#x6570;&#x5B57;&#x8BB0;&#x5F55;&#x7684;&#xFF0C;&#x5B83;&#x7684;&#x591A;&#x5C11;&#x51B3;&#x5B9A;&#x6211;&#x4EEC;&#x662F;&#x5426;&#x8981;&#x56DE;&#x57CE;&#xFF0C;&#x662F;&#x5426;&#x80FD;&#x4E70;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x88C5;&#x5907;&#xFF1B;&#x6211;&#x4EEC;&#x5728;&#x7F51;&#x4E0A;&#x8D2D;&#x7269;&#x65F6;&#xFF0C;&#x5404;&#x79CD;&#x5546;&#x54C1;&#x4EF7;&#x683C;&#x4E5F;&#x662F;&#x7528;&#x6570;&#x5B57;&#x8BB0;&#x5F55;&#x7684;&#xFF0C;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x7D2F;&#x52A0;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x82B1;&#x51FA;&#x53BB;&#x94B1;&#x7684;&#x6570;&#x989D;&#xFF1B;&#x5927;&#x5230;&#x6211;&#x4EEC;&#x5FAE;&#x4FE1;&#x652F;&#x4ED8;&#x5B9D;&#x91CC;&#x7684;&#x4F59;&#x989D;&#xFF0C;&#x5C0F;&#x5230;&#x53D1;&#x4E86;&#x4E00;&#x6761;&#x670B;&#x53CB;&#x5708;&#x88AB;&#x70B9;&#x4E86;&#x591A;&#x5C11;&#x4E2A;&#x8D5E;&#x3002;&#x8FD9;&#x4E9B;&#xFF0C;&#x90FD;&#x662F;&#x6570;&#x5B57;&#x3002;&#x53EF;&#x4EE5;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x751F;&#x6D3B;&#x4E2D;&#x6570;&#x5B57;&#x65E0;&#x5904;&#x4E0D;&#x5728;&#xFF0C;&#x540C;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x667A;&#x80FD;&#x8BBE;&#x5907;&#x4E0A;&#x8DD1;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x6570;&#x5B57;&#x4E5F;&#x65E0;&#x5904;&#x4E0D;&#x5728;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x91CC;&#xFF0C;&#x4E5F;&#x5C31;&#x6709;&#x4E86;&#x6570;&#x5B57;&#x7C7B;&#x578B;&#x3002;</p>
<p>&#x5728;Python&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7B80;&#x5355;&#x7684;&#x628A;&#x5E38;&#x7528;&#x7684;&#x6570;&#x5B57;&#x7C7B;&#x578B;&#x5206;&#x4E3A;&#x4E86;&#x4E09;&#x79CD;&#xFF0C;&#x5373;&#x6574;&#x6570;&#x3001;&#x6D6E;&#x70B9;&#x6570;&#x548C;&#x590D;&#x6570;&#x3002;</p>
<h3 id="&#x6574;&#x6570;int"><a name="&#x6574;&#x6570;int" class="anchor-navigation-ex-anchor" href="#&#x6574;&#x6570;int"><i class="fa fa-link" aria-hidden="true"></i></a>1.2.1. &#x6574;&#x6570;(int)</h3>
<p>Python&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x6574;&#x6570;&#x4E0E;&#x6211;&#x4EEC;&#x65E5;&#x5E38;&#x63A5;&#x89E6;&#x548C;&#x7406;&#x89E3;&#x7684;&#x6574;&#x6570;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x5373;&#x6CA1;&#x6709;&#x5C0F;&#x6570;&#x70B9;&#x975E;0&#x5F00;&#x5934;&#x7684;&#x6570;&#x5B57;&#x4EEC;&#x3002;&#x8FD9;&#x91CC;&#x4E0D;&#x7528;&#x7591;&#x60D1;&#x1F914;&#xFF0C;&#x518D;&#x662F;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x4E5F;&#x662F;&#x6211;&#x4EEC;&#x4EBA;&#x7C7B;&#x53D1;&#x660E;&#x7684;&#xFF0C;&#x4E5F;&#x662F;&#x4E3A;&#x6211;&#x4EEC;&#x4EBA;&#x7C7B;&#x800C;&#x670D;&#x52A1;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5B83;&#x603B;&#x662F;&#x9700;&#x8981;&#x8DDF;&#x6211;&#x4EEC;&#x4EBA;&#x7C7B;&#x4E16;&#x754C;&#x6709;&#x76F8;&#x901A;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x6574;&#x6570;&#x5305;&#x62EC;&#x6B63;&#x6574;&#x6570;&#x3001;&#x8D1F;&#x6570;&#x548C;0&#x3002;&#x5E76;&#x4E14;&#x4E0D;&#x540C;&#x4E8E;&#x5176;&#x4ED6;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x5728;Python&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x7528;&#x8003;&#x8651;&#x5F88;&#x591A;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x6570;&#x5B57;&#x90FD;&#x53EF;&#x4EE5;&#x4E0D;&#x9650;&#x5236;&#x4F4D;&#x6570;&#x548C;&#x5927;&#x5C0F;&#xFF0C;&#x90FD;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x6765;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x7684;&#x7B80;&#x5355;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF1A;</p>
<blockquote>
<p>31415926535897932384626</p>
<p>66666666666666666666666666666666666666666666666666666666</p>
<p>-2021</p>
<p>0</p>
</blockquote>
<p>&#x5982;&#x4EE5;&#x4E0A;&#x8FD9;&#x4E9B;&#x6570;&#x5B57;&#xFF0C;&#x53EA;&#x8981;&#x6CA1;&#x6709;&#x5C0F;&#x6570;&#x70B9;&#xFF0C;&#x53EA;&#x8981;&#x6211;&#x4EEC;&#x9700;&#x8981;&#xFF0C;&#x6211;&#x4EEC;&#x4FBF;&#x90FD;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x4F5C;&#x4E3A;&#x503C;&#x5B58;&#x8FDB;&#x6211;&#x4EEC;&#x8D77;&#x597D;&#x540D;&#x5B57;&#x7684;&#x53D8;&#x91CF;&#x91CC;&#x53BB;&#xFF0C;&#x8C01;&#x8FD8;&#x4E0D;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x7684;&#x652F;&#x4ED8;&#x5B9D;&#x4F59;&#x989D;&#x6C38;&#x8FDC;&#x662F;9&#x5F00;&#x5934;&#x7684;&#x4E14;&#x6709;&#x5F88;&#x591A;&#x4F4D;&#x5462;&#x1F609;&#x3002;</p>
<pre class="language-"><code class="lang-python">zhifubaoyue <span class="token operator">=</span> <span class="token number">9999999999999999999999999999999999999999999999999</span>
</code></pre>
<p>&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x628A;&#x8FD9;&#x4E48;&#x5927;&#x7684;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x5B58;&#x8FDB;&#x4E86;&#x4E00;&#x4E2A;&#x53EB;&#x201C;zhifubaoyue&#x201D;&#x7684;&#x53D8;&#x91CF;&#x4E2D;&#x53BB;&#x3002;&#x8981;&#x662F;&#x771F;&#x7684;&#x8BE5;&#x591A;&#x597D;&#x3002;&#x54C8;&#x54C8;&#x54C8;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x628A;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#xFF0C;&#x5B58;&#x8FDB;&#x53D8;&#x91CF;&#x540D;&#x53BB;&#x4E4B;&#x540E;&#xFF0C;&#x6309;&#x7167;&#x524D;&#x9762;&#x6240;&#x8BB2;&#x8FC7;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x540D;&#x53EB;&#x201C;zhifubaoyue&#x201D;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5B83;&#x7684;&#x503C;&#x4E3A;&#x4E00;&#x4E32;&#x8BA9;&#x6211;&#x4EEC;&#x5DE8;&#x723D;&#x7684;&#x201C;&#x6574;&#x6570;&#x201D;&#x3002;&#x90A3;&#x4E48;&#x5B83;&#x7684;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x6B63;&#x662F;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x6240;&#x8BF4;&#x7684;&#x6574;&#x6570;&#xFF08;int&#xFF09;&#x3002;&#x81F3;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x4FBF;&#x5B8C;&#x6574;&#x7684;&#x8BA4;&#x8BC6;&#x4E86;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x53CA;&#x5176;&#x4E09;&#x4E2A;&#x57FA;&#x672C;&#x5C5E;&#x6027;&#xFF1A;1&#x3001;&#x53D8;&#x91CF;&#x540D;&#x79F0;&#x3002;2&#x3001;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x3002;3&#x3001;&#x53D8;&#x91CF;&#x503C;&#x3002;&#x5177;&#x4F53;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="../../../assets/Unit01/image-20210702215153429.png" alt="image-20210702215153429"></p>
<p>&#x800C;&#xFF0C;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#xFF0C;&#x5219;&#x662F;&#x6839;&#x636E;&#x53D8;&#x91CF;&#x503C;&#x6765;&#x51B3;&#x5B9A;&#x7684;&#xFF0C;&#x5982;&#x56FE;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x503C;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x53D8;&#x91CF;&#x7684;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x5219;&#x4E3A;&#xFF1A;int&#xFF08;&#x6574;&#x6570;&#xFF09;</p>
<h3 id="&#x6D6E;&#x70B9;&#x6570;"><a name="&#x6D6E;&#x70B9;&#x6570;" class="anchor-navigation-ex-anchor" href="#&#x6D6E;&#x70B9;&#x6570;"><i class="fa fa-link" aria-hidden="true"></i></a>1.2.2. &#x6D6E;&#x70B9;&#x6570;</h3>
<p>&#x5728;&#x4E86;&#x89E3;&#x4E86;&#x6574;&#x6570;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x6765;&#x770B;&#x770B;&#x6570;&#x5B57;&#x5927;&#x5BB6;&#x5EAD;&#x4E2D;&#x7684;&#x53E6;&#x5916;&#x4E00;&#x4F4D;&#x5144;&#x5F1F;&#xFF1A;&#x6D6E;&#x70B9;&#x6570;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x5E38;&#x8BF4;&#x7684;&#x5C0F;&#x6570;&#x3002;&#x4F8B;&#x5982;&#xFF1A;1.414&#x3001;-1.024&#x3001;0.5&#x3001;3.1415926&#x7B49;&#xFF0C;&#x50CF;&#x6211;&#x4EEC;&#x65E5;&#x5E38;&#x7684;&#x8EAB;&#x9AD8;&#xFF0C;&#x4F53;&#x91CD;&#xFF0C;&#x7B49;&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x7B97;&#x662F;&#x6D6E;&#x70B9;&#x6570;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF1A;&#x8457;&#x540D;&#x7BEE;&#x7403;&#x8FD0;&#x52A8;&#x5458;&#x79D1;&#x6BD4;&#x7684;&#x8EAB;&#x9AD8;(&#x5355;&#x4F4D;:m)&#x548C;&#x5706;&#x5468;&#x7387;Pi&#x53D6;&#x5C0F;&#x6570;&#x70B9;&#x540E;&#x4E03;&#x4F4D;</p>
<pre class="language-"><code class="lang-python">kobeHeight <span class="token operator">=</span> <span class="token number">1.98</span>
pi <span class="token operator">=</span> <span class="token number">3.1415926</span>
</code></pre>
<p>&#x8FD9;&#x91CC;&#xFF0C;&#x548C;&#x524D;&#x9762;&#x7684;&#x6574;&#x6570;&#x4E00;&#x6837;&#xFF0C;&#x201C;=&#x201D;&#x7B49;&#x53F7;&#x5DE6;&#x8FB9;&#x662F;&#x53D8;&#x91CF;&#x540D;&#x79F0;&#xFF0C;&#x53F3;&#x8FB9;&#x662F;&#x53D8;&#x91CF;&#x7684;&#x503C;&#xFF0C;&#x800C;&#x53D8;&#x91CF;&#x7684;&#x7C7B;&#x578B;&#x6839;&#x636E;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x6765;&#x51B3;&#x5B9A;&#x3002;&#x8FD9;&#x91CC;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x503C;&#x90FD;&#x662F;&#x5C0F;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x4EEC;&#x7684;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x5219;&#x4E3A;&#xFF1A;float&#xFF08;&#x6D6E;&#x70B9;&#x6570;&#xFF09;</p>
<h3 id="&#x590D;&#x6570;"><a name="&#x590D;&#x6570;" class="anchor-navigation-ex-anchor" href="#&#x590D;&#x6570;"><i class="fa fa-link" aria-hidden="true"></i></a>1.2.3. &#x590D;&#x6570;</h3>
<p>&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x4E00;&#x4E9B;&#x79D1;&#x5B66;&#x8BA1;&#x7B97;&#xFF0C;Python&#x4E2D;&#x4E5F;&#x6709;&#x590D;&#x6570;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x4EC5;&#x4F5C;&#x4E86;&#x89E3;&#x3002;</p>
<p>&#x5728;Python&#x4E2D;&#xFF0C;&#x590D;&#x6570;&#x8DDF;&#x6211;&#x4EEC;&#x73B0;&#x5B9E;&#x4E2D;&#x4E00;&#x81F4;&#xFF0C;&#x590D;&#x6570;&#x7531;&#x5B9E;&#x90E8;&#x548C;&#x865A;&#x90E8;&#x4E24;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#xFF0C;&#x5E76;&#x7528;j&#x8868;&#x793A;&#x865A;&#x90E8;&#x3002;&#x4F8B;&#x5982;&#xFF1A;&#x4E00;&#x4E2A;&#x590D;&#x6570;&#x7684;&#x5B9E;&#x90E8;&#x4E3A;3.14&#xFF0C;&#x865A;&#x90E8;&#x4E3A;12.5&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x5B9A;&#x4E49;&#x65F6;&#x5982;&#x4E0B;&#x8FDB;&#x884C;&#x8D4B;&#x503C;&#xFF1A;</p>
<pre class="language-"><code class="lang-python">a <span class="token operator">=</span> <span class="token number">3.14</span><span class="token operator">+</span><span class="token number">12.5j</span> <span class="token comment">#&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x503C;&#x7684;&#x5B9E;&#x90E8;&#x4E3A;3.14&#xFF0C;&#x865A;&#x90E8;&#x4E3A;12.5&#xFF0C;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x4E3A;&#x590D;&#x6570;&#xFF0C;&#x53D8;&#x91CF;&#x540D;&#x79F0;&#x4E3A;a&#x7684;&#x53D8;&#x91CF;</span>
<span class="token keyword">print</span><span class="token punctuation">(</span>a<span class="token punctuation">)</span> <span class="token comment">#&#x6253;&#x5370;&#x8FD9;&#x4E2A;&#x590D;&#x6570;&#x53D8;&#x91CF;</span>
<span class="token keyword">print</span><span class="token punctuation">(</span><span class="token builtin">type</span><span class="token punctuation">(</span>a<span class="token punctuation">)</span><span class="token punctuation">)</span> <span class="token comment">#&#x6253;&#x5370;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x53D8;&#x91CF;&#x7C7B;&#x578B;</span>
</code></pre>
<p>&#x5982;&#x56FE;&#xFF1A;</p>
<p><img src="../../../assets/Unit01/image-20210702223212040.png" alt="image-20210702223212040"></p>
<p>&#x4EE5;&#x4E0A;&#x5C31;&#x662F;&#x590D;&#x6570;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#x3002;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x4EC5;&#x4F5C;&#x7B80;&#x5355;&#x4E86;&#x89E3;&#x3002;</p>
<hr>
<h2 id="&#x5B57;&#x7B26;&#x4E32;&#x7C7B;&#x578B;"><a name="&#x5B57;&#x7B26;&#x4E32;&#x7C7B;&#x578B;" class="anchor-navigation-ex-anchor" href="#&#x5B57;&#x7B26;&#x4E32;&#x7C7B;&#x578B;"><i class="fa fa-link" aria-hidden="true"></i></a>1.3. &#x5B57;&#x7B26;&#x4E32;&#x7C7B;&#x578B;</h2>
<p>&#x6211;&#x4EEC;&#x5E38;&#x89C1;&#x7684;&#x5982;&#xFF1A;&#x201C;&#x6C5F;&#x5357;&#x76AE;&#x9769;&#x5382;&#x5012;&#x95ED;&#x5566;&#x201D;&#x8FD9;&#x6837;&#x4E00;&#x53E5;&#x8BDD;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x5B57;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x3002;&#x5F53;&#x5B83;&#x4EEC;&#x8FDE;&#x8D77;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x5982;&#x679C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5B57;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;&#x201C;&#x6211;&#x201D;&#x3002;&#x90A3;&#x5C31;&#x65F6;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x7528;&#x8003;&#x8651;&#x592A;&#x591A;&#xFF0C;&#x6BD5;&#x7ADF;Python&#x8BED;&#x8A00;&#x4E0D;&#x50CF;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x90A3;&#x4E48;&#x590D;&#x6742;&#xFF0C;&#x4F60;&#x4E0D;&#x5FC5;&#x4E3A;&#x4E86;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5355;&#x72EC;&#x8BB0;&#x5FC6;&#x4E00;&#x79CD;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x3002;&#x50CF;&#x201C;Python&#x201D;&#xFF0C;&#x8FD9;&#x5176;&#x4E2D;&#x6BCF;&#x4E00;&#x4E2A;&#x5B57;&#x6BCD;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x51FA;&#x73B0;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>
<p><img src="../../../assets/Unit01/image-20210702224354800.png" alt="image-20210702224354800"></p>
<p>&#x5728;&#x4E0A;&#x56FE;&#x4E2D;&#xFF0C;&#x5F53;&#x4E00;&#x6BB5;&#x6587;&#x5B57;&#xFF0C;&#x65E2;&#x6709;&#x4E2D;&#x6587;&#xFF0C;&#x4E5F;&#x6709;&#x82F1;&#x6587;&#xFF0C;&#x8FD8;&#x6709;&#x5404;&#x79CD;&#x6807;&#x70B9;&#x7B26;&#x53F7;&#x65F6;&#xFF0C;&#x5B83;&#x4EEC;&#x4E5F;&#x7B97;&#x4F5C;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>
<p>&#x5728;Python&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x5B57;&#x6BCD;&#x3001;&#x6C49;&#x5B50;&#x3001;&#x7B26;&#x53F7;&#x7B49;&#x90FD;&#x7B97;&#x4F5C;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x5F53;&#x5B83;&#x4EEC;&#x4EE5;&#x4EFB;&#x610F;&#x5355;&#x4E2A;&#x51FA;&#x73B0;or&#x591A;&#x4E2A;&#x4EE5;&#x4EFB;&#x610F;&#x6392;&#x5217;&#x548C;&#x7EC4;&#x5408;&#x7684;&#x5F62;&#x5F0F;&#x51FA;&#x73B0;&#x65F6;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x53EF;&#x4EE5;&#x7B97;&#x4F5C;&#x662F;&#x4E00;&#x4E2A;&#x201C;&#x5B57;&#x7B26;&#x4E32;&#x201D;&#x7C7B;&#x578B;&#x7684;&#x201C;&#x503C;&#x201D;&#x3002;</p>
<p>&#x88C5;&#x7740;&#x8FD9;&#x4E2A;&#x503C;&#x7684;&#x53D8;&#x91CF;&#x7684;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x5219;&#x4E3A;&#xFF1A;str&#xFF08;&#x5B57;&#x7B26;&#x4E32;&#xFF09;</p>
<p>&#x4F8B;&#x5982;&#xFF1A;</p>
<pre class="language-"><code class="lang-python">a <span class="token operator">=</span> <span class="token string">&quot;Python&#x7531;&#x8377;&#x5170;&#x6570;&#x5B66;&#x548C;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x7814;&#x7A76;&#x5B66;&#x4F1A;&#x7684;Guido van Rossum&#x4E8E;1990&#x5E74;&#x4EE3;&#x521D;&#x8BBE;&#x8BA1;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x95E8;&#x53EB;&#x505A;ABC&#x8BED;&#x8A00;&#x7684;&#x66FF;&#x4EE3;&#x54C1;&#x3002;Python&#x63D0;&#x4F9B;&#x4E86;&#x9AD8;&#x6548;&#x7684;&#x9AD8;&#x7EA7;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x8FD8;&#x80FD;&#x7B80;&#x5355;&#x6709;&#x6548;&#x5730;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x3002;Python&#x8BED;&#x6CD5;&#x548C;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#xFF0C;&#x4EE5;&#x53CA;&#x89E3;&#x91CA;&#x578B;&#x8BED;&#x8A00;&#x7684;&#x672C;&#x8D28;&#xFF0C;&#x4F7F;&#x5B83;&#x6210;&#x4E3A;&#x591A;&#x6570;&#x5E73;&#x53F0;&#x4E0A;&#x5199;&#x811A;&#x672C;&#x548C;&#x5FEB;&#x901F;&#x5F00;&#x53D1;&#x5E94;&#x7528;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x968F;&#x7740;&#x7248;&#x672C;&#x7684;&#x4E0D;&#x65AD;&#x66F4;&#x65B0;&#x548C;&#x8BED;&#x8A00;&#x65B0;&#x529F;&#x80FD;&#x7684;&#x6DFB;&#x52A0;&#xFF0C;&#x9010;&#x6E10;&#x88AB;&#x7528;&#x4E8E;&#x72EC;&#x7ACB;&#x7684;&#x3001;&#x5927;&#x578B;&#x9879;&#x76EE;&#x7684;&#x5F00;&#x53D1;&#x3002;&quot;</span>
<span class="token keyword">print</span><span class="token punctuation">(</span>a<span class="token punctuation">)</span> <span class="token comment">#&#x8F93;&#x51FA;&#x53D8;&#x91CF;a&#x7684;&#x503C;</span>
<span class="token keyword">print</span><span class="token punctuation">(</span><span class="token builtin">type</span><span class="token punctuation">(</span>a<span class="token punctuation">)</span><span class="token punctuation">)</span> <span class="token comment">#&#x8F93;&#x51FA;&#x53D8;&#x91CF;a&#x7684;&#x53D8;&#x91CF;&#x7C7B;&#x578B;</span>
</code></pre>
<p>&#x4E0A;&#x8FF0;&#x4EE3;&#x7801;&#x7684;&#x8FD0;&#x884C;&#x7ED3;&#x679C;&#x4E3A;&#xFF1A;</p>
<p><img src="../../../assets/Unit01/image-20210702225255682.png" alt="image-20210702225255682"></p>
<p><img src="../../../assets/Unit01/image-20210702225757928.png" alt="image-20210702225757928"></p>
<p>&#x6700;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x5728;&#x5BF9;&#x53D8;&#x91CF;&#x8FDB;&#x884C;&#x8D4B;&#x503C;&#x65F6;&#xFF0C;&#x8981;&#x5C06;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x503C;&#x7528;&#x201C;&#x201D;&#x4E00;&#x5BF9;&#x53CC;&#x5F15;&#x53F7;or&#x2018;&#x2019;&#x4E00;&#x5BF9;&#x5355;&#x5F15;&#x53F7;&#x62EC;&#x8D77;&#x6765;&#xFF0C;&#x4EE5;&#x544A;&#x8BC9;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x8FD9;&#x4E2A;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x65B0;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x6765;&#x4E86;&#xFF1A;&#x5982;&#x679C;&#x8981;&#x662F;&#x60F3;&#x901A;&#x8FC7;&#x7A0B;&#x5E8F;&#xFF0C;&#x8BA9;&#x8BA1;&#x7B97;&#x673A;&#x8F93;&#x51FA;&#x4E0B;&#x9762;&#x90A3;&#x53E5;&#x9C81;&#x8FC5;&#x5148;&#x751F;&#x7684;&#x8BDD;&#x8981;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;</p>
<blockquote>
<p>&#x7136;&#x800C;&#x4E5F;&#x6709;&#x7ECF;&#x8FC7;&#x8BB8;&#x591A;&#x4EBA;&#x7ECF;&#x9A8C;&#x4E4B;&#x540E;&#xFF0C;&#x5012;&#x7ED9;&#x4E86;&#x540E;&#x4EBA;&#x574F;&#x5F71;&#x54CD;&#x7684;&#xFF0C;&#x5982;&#x4FD7;&#x8BED;&#x8BF4;&#x201C;&#x5404;&#x626B;&#x81EA;&#x5BB6;&#x95E8;&#x524D;&#x96EA;&#xFF0C;&#x83AB;&#x7BA1;&#x4ED6;&#x4EBA;&#x74E6;&#x4E0A;&#x971C;&#x201D;&#x7684;&#x4FBF;&#x662F;&#x5176;&#x4E00;&#x3002;</p>
</blockquote>
<p>&#x7EC6;&#x5FC3;&#x7684;&#x540C;&#x5B66;&#x5DF2;&#x7ECF;&#x53D1;&#x73B0;&#x4E86;&#xFF0C;&#x8FD9;&#x53E5;&#x8BDD;&#x4E2D;&#x95F4;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x4E00;&#x5BF9;&#x53CC;&#x5F15;&#x53F7;&#x3002;&#x4F1A;&#x4E0D;&#x4F1A;&#x8DDF;&#x5B9A;&#x4E49;&#x5B57;&#x7B26;&#x4E32;&#x53D8;&#x91CF;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x90A3;&#x4E00;&#x5BF9;&#x53CC;&#x5F15;&#x53F7;&#x51B2;&#x7A81;&#x5462;&#xFF1F;</p>
<p>&#x5982;&#xFF1A;</p>
<pre class="language-"><code class="lang-python">a <span class="token operator">=</span> <span class="token string">&quot;&#x7136;&#x800C;&#x4E5F;&#x6709;&#x7ECF;&#x8FC7;&#x8BB8;&#x591A;&#x4EBA;&#x7ECF;&#x9A8C;&#x4E4B;&#x540E;&#xFF0C;&#x5012;&#x7ED9;&#x4E86;&#x540E;&#x4EBA;&#x574F;&#x5F71;&#x54CD;&#x7684;&#xFF0C;&#x5982;&#x4FD7;&#x8BED;&#x8BF4;&quot;</span>&#x5404;&#x626B;&#x81EA;&#x5BB6;&#x95E8;&#x524D;&#x96EA;&#xFF0C;&#x83AB;&#x7BA1;&#x4ED6;&#x4EBA;&#x74E6;&#x4E0A;&#x971C;<span class="token string">&quot;&#x7684;&#x4FBF;&#x662F;&#x5176;&#x4E00;&#x3002;&quot;</span>
</code></pre>
<p>&#x663E;&#x7136;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x80FD;&#x4ECE;&#x4E0A;&#x8FF0;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x4E2D;&#x770B;&#x51FA;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x653E;&#x5230;&#x7A0B;&#x5E8F;&#x91CC;&#x8FD0;&#x884C;&#x4F1A;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5462;&#xFF1F;</p>
<p><img src="../../../assets/Unit01/image-20210702231718462.png" alt="image-20210702231718462"></p>
<p>&#x5982;&#x4E0A;&#x56FE;&#xFF1A;&#x7A0B;&#x5E8F;&#x5E76;&#x6CA1;&#x6709;&#x8FD0;&#x884C;&#xFF0C;&#x5E76;&#x51FA;&#x5E2D;&#x4E86;&#x7EA2;&#x8272;&#x7684;&#x9519;&#x8BEF;&#x63D0;&#x793A;&#xFF0C;&#x5982;SyntaxError</p>
<p>&#x90A3;&#x4E48;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x53D1;&#x751F;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x51B5;&#x5462;&#xFF1F;&#x5176;&#x5B9E;&#x539F;&#x56E0;&#x5C31;&#x5728;&#x4E8E;&#xFF0C;&#x51FA;&#x73B0;&#x4E86;&#x4E24;&#x5BF9;&#x53CC;&#x94F6;&#x884C;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x8FD9;&#x5C0F;&#x5B50;&#x7B28;&#x86CB;&#x5B83;&#x61F5;&#x903C;&#x4E86;&#x3002;</p>
<p>&#x8BA1;&#x7B97;&#x673A;&#x770B;&#x5230;&#x7A0B;&#x5E8F;&#x91CC;&#x7684;&#x4E24;&#x5BF9;&#x53CC;&#x97F3;&#x53F7;&#xFF0C;&#x5B83;&#x76F4;&#x63A5;&#x61F5;&#x903C;&#x1F628;&#xFF0C;&#x8FD9;&#x662F;&#x4EC0;&#x4E48;&#x9B3C;&#x1F631;&#xFF0C;&#x5230;&#x5E95;&#x54EA;&#x4E2A;&#x53CC;&#x5F15;&#x53F7;&#x91CC;&#x662F;&#x8FD9;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x7C7B;&#x578B;&#x53D8;&#x91CF;a&#x7684;&#x503C;&#x1F62D;&#xFF1F;</p>
<p>&#x90A3;&#x9047;&#x5230;&#x8FD9;&#x79CD;&#x72B6;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x600E;&#x4E48;&#x5904;&#x7406;&#x5462;&#xFF1F;&#x522B;&#x6025;&#xFF0C;Python&#x7684;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x65E9;&#x5C31;&#x4E3A;&#x6211;&#x4EEC;&#x60F3;&#x5230;&#x4E86;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8BA4;&#x8BC6;Python&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x4E86;&#x2014;&#x2014;&#x8F6C;&#x4E49;&#x5B57;&#x7B26;</p>
<h3 id="&#x8F6C;&#x4E49;&#x5B57;&#x7B26;"><a name="&#x8F6C;&#x4E49;&#x5B57;&#x7B26;" class="anchor-navigation-ex-anchor" href="#&#x8F6C;&#x4E49;&#x5B57;&#x7B26;"><i class="fa fa-link" aria-hidden="true"></i></a>1.3.1. &#x8F6C;&#x4E49;&#x5B57;&#x7B26;</h3>
<p>&#x8F6C;&#x4E49;&#x5B57;&#x7B26;&#xFF0C;&#x5C31;&#x662F;&#x5BF9;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x5B57;&#x7B26;&#x8FDB;&#x884C;&#x8F6C;&#x4E49;&#x5904;&#x7406;&#x3002;&#x5982;&quot;&quot;&#x53CC;&#x5F15;&#x53F7;&#xFF0C;&#x5728;Pyhton&#x4E2D;&#x4E00;&#x822C;&#x7684;&#x610F;&#x4E49;&#x5C31;&#x662F;&#x544A;&#x8BC9;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x8FD9;&#x4E2D;&#x95F4;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#x503C;&#x3002;&#x4F46;&#x96BE;&#x514D;&#x51FA;&#x73B0;&#x53D8;&#x91CF;&#x503C;&#x4E2D;&#x9971;&#x542B;&#x4E00;&#x5BF9;&#x53CC;&#x5F15;&#x53F7;&#x3002;&#x90A3;&#x8981;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x8F6C;&#x4E49;&#x5B57;&#x7B26;&#xFF0C;&#x8F6C;&#x53D8;&#x503C;&#x4E2D;&#x53CC;&#x5F15;&#x53F7;&#x7684;&#x610F;&#x4E49;&#xFF0C;&#x544A;&#x8BC9;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x8FD9;&#x91CC;&#x9762;&#x7684;&#x8FD9;&#x4E00;&#x5BF9;&#x53CC;&#x5F15;&#x53F7;&#x662F;&#x53D8;&#x91CF;&#x503C;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x90A3;&#x4E48;&#x600E;&#x4E48;&#x64CD;&#x4F5C;&#x5462;&#xFF1F;&#x5176;&#x5B9E;&#x4E5F;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x5C31;&#x662F;&#x5728;&#x8981;&#x8F6C;&#x4E49;&#x7684;&#x5B57;&#x7B26;&#x524D;&#x52A0;&#x4E00;&#x4E2A;&#x201C;\&#x201D;&#x7531;&#x4E0A;&#x5411;&#x4E0B;&#x7684;&#x53CD;&#x659C;&#x6760;&#x3002;&#x5982;&#xFF1A;</p>
<pre class="language-"><code class="lang-python">a <span class="token operator">=</span> <span class="token string">&quot;&#x7136;&#x800C;&#x4E5F;&#x6709;&#x7ECF;&#x8FC7;&#x8BB8;&#x591A;&#x4EBA;&#x7ECF;&#x9A8C;&#x4E4B;&#x540E;&#xFF0C;&#x5012;&#x7ED9;&#x4E86;&#x540E;&#x4EBA;&#x574F;&#x5F71;&#x54CD;&#x7684;&#xFF0C;&#x5982;&#x4FD7;&#x8BED;&#x8BF4;\&quot;&#x5404;&#x626B;&#x81EA;&#x5BB6;&#x95E8;&#x524D;&#x96EA;&#xFF0C;&#x83AB;&#x7BA1;&#x4ED6;&#x4EBA;&#x74E6;&#x4E0A;&#x971C;\&quot;&#x7684;&#x4FBF;&#x662F;&#x5176;&#x4E00;&#x3002;&quot;</span>
<span class="token keyword">print</span><span class="token punctuation">(</span>a<span class="token punctuation">)</span>
</code></pre>
<p>&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</p>
<p><img src="../../../assets/Unit01/image-20210702232953215.png" alt="image-20210702232953215"></p>
<p>&#x4F46;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x56FE;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x592A;&#x957F;&#x4E86;&#xFF0C;&#x770B;&#x7740;&#x4E0D;&#x65B9;&#x4FBF;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x4E0D;&#x80FD;&#x7ED9;&#x4ED6;&#x4E2D;&#x95F4;&#x6362;&#x4E2A;&#x884C;&#xFF0C;&#x5206;&#x4E24;&#x884C;&#x663E;&#x793A;&#x5462;&#xFF1F;</p>
<p>&#x5982;&#xFF1A;</p>
<pre class="language-"><code class="lang-python">a <span class="token operator">=</span> &quot;&#x7136;&#x800C;&#x4E5F;&#x6709;&#x7ECF;&#x8FC7;&#x8BB8;&#x591A;&#x4EBA;&#x7ECF;&#x9A8C;&#x4E4B;&#x540E;&#xFF0C;&#x5012;&#x7ED9;&#x4E86;&#x540E;&#x4EBA;&#x574F;&#x5F71;&#x54CD;&#x7684;&#xFF0C;
&#x5982;&#x4FD7;&#x8BED;&#x8BF4;\<span class="token string">&quot;&#x5404;&#x626B;&#x81EA;&#x5BB6;&#x95E8;&#x524D;&#x96EA;&#xFF0C;&#x83AB;&#x7BA1;&#x4ED6;&#x4EBA;&#x74E6;&#x4E0A;&#x971C;\&quot;&#x7684;&#x4FBF;&#x662F;&#x5176;&#x4E00;&#x3002;&quot;</span>
<span class="token keyword">print</span><span class="token punctuation">(</span>a<span class="token punctuation">)</span>
</code></pre>
<p>&#x5176;&#x5B9E;&#x4ECE;&#x4E0A;&#x9762;&#x7684;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x5DF2;&#x7ECF;&#x80FD;&#x591F;&#x770B;&#x51FA;&#x6765;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x5B9A;&#x662F;&#x6709;&#x95EE;&#x9898;&#x7684;&#x3002;&#x90A3;&#x5B9E;&#x9645;&#x8FD0;&#x884C;&#x5462;&#xFF1F;</p>
<p><img src="../../../assets/Unit01/image-20210702233342086.png" alt="image-20210702233342086"></p>
<p>&#x7ED3;&#x679C;&#x53C8;&#x62A5;&#x9519;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x7684;&#x6362;&#x4E2A;&#x884C;&#x8BF6;&#xFF0C;&#x8FD9;&#x5BF9;&#x8BA1;&#x7B97;&#x673A;&#x5F88;&#x96BE;&#x561B;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x5B83;&#x90FD;&#x8981;&#x62A5;&#x9519;&#x1F914;&#x3002;</p>
<p>&#x663E;&#x7136;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x6BD4;&#x6211;&#x4EEC;&#x60F3;&#x8C61;&#x7684;&#x8981;&#x7B28;&#x5F88;&#x591A;&#xFF0C;&#x5B83;&#x4E0D;&#x61C2;&#x6211;&#x4EEC;&#x806A;&#x660E;&#x7684;&#x4EBA;&#x7C7B;&#xFF0C;&#x76F4;&#x63A5;&#x5728;&#x952E;&#x76D8;&#x4E0A;&#x6572;&#x4E2A;&#x56DE;&#x8F66;&#x952E;&#x7684;&#x6362;&#x884C;&#x3002;&#x4F46;&#x6211;&#x4EEC;&#x53C8;&#x9700;&#x8981;&#x6362;&#x884C;&#xFF0C;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;&#x522B;&#x6025;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x8FD8;&#x662F;&#x8F6C;&#x4E49;&#x5B57;&#x7B26;&#x3002;&#x8BA9;&#x8F6C;&#x4E49;&#x5B57;&#x7B26;&#x5E2E;&#x6211;&#x4EEC;&#x6362;&#x884C;&#x3002;&#x8FD9;&#x6B21;&#x8981;&#x7528;&#x5230;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x201C;\n&#x201D;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x201C;\&#x201D;&#x53CD;&#x659C;&#x6760;&#xFF0C;&#x5C06;&#x5C0F;&#x5199;&#x5B57;&#x6BCD;&#x7684;n&#x8F6C;&#x4E49;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x8F6C;&#x4E49;&#x540E;&#x7684;n&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x201C;&#x6362;&#x884C;&#x4E86;&#x201D;&#xFF0C;&#x4E0D;&#x4FE1;&#x6211;&#x4EEC;&#x8BD5;&#x8BD5;&#x770B;&#xFF5E;</p>
<pre class="language-"><code class="lang-python">a <span class="token operator">=</span> <span class="token string">&quot;&#x7136;&#x800C;&#x4E5F;&#x6709;&#x7ECF;&#x8FC7;&#x8BB8;&#x591A;&#x4EBA;&#x7ECF;&#x9A8C;&#x4E4B;&#x540E;&#xFF0C;&#x5012;&#x7ED9;&#x4E86;&#x540E;&#x4EBA;&#x574F;&#x5F71;&#x54CD;&#x7684;&#xFF0C;\n&#x5982;&#x4FD7;&#x8BED;&#x8BF4;\&quot;&#x5404;&#x626B;&#x81EA;&#x5BB6;&#x95E8;&#x524D;&#x96EA;&#xFF0C;&#x83AB;&#x7BA1;&#x4ED6;&#x4EBA;&#x74E6;&#x4E0A;&#x971C;\&quot;&#x7684;&#x4FBF;&#x662F;&#x5176;&#x4E00;&#x3002;&quot;</span>
<span class="token keyword">print</span><span class="token punctuation">(</span>a<span class="token punctuation">)</span>
</code></pre>
<p>&#x4E0A;&#x56FE;&#xFF1A;</p>
<p><img src="../../../assets/Unit01/image-20210702233813534.png" alt="image-20210702233813534"></p>
<p>&#x679C;&#x7136;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x6DFB;&#x52A0;&#x4E86;&#x8F6C;&#x4E49;&#x5B57;&#x7B26;&#x7684;&#x5730;&#x65B9;&#x6362;&#x884C;&#x4E86;&#x3002;&#x800C;&#x4E14;&#x6CA1;&#x6709;&#x62A5;&#x9519;&#x54DF;&#xFF01;</p>
<p>&#x4E0B;&#x9762;&#xFF0C;&#x4ECB;&#x7ECD;&#x51E0;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#x8F6C;&#x4E49;&#x5B57;&#x7B26;&#xFF1A;</p>
<table>
<thead>
<tr>
<th>&#x8F6C;&#x4E49;&#x5B57;&#x7B26;</th>
<th>&#x8BF4;&#x660E;</th>
</tr>
</thead>
<tbody>
<tr>
<td>\\</td>
<td>&#x53CD;&#x659C;&#x6760;&#x53F7;</td>
</tr>
<tr>
<td>\&quot;</td>
<td>&#x53CC;&#x5F15;&#x53F7;</td>
</tr>
<tr>
<td>\&apos;</td>
<td>&#x5355;&#x5F15;&#x53F7;</td>
</tr>
<tr>
<td>\n</td>
<td>&#x6362;&#x884C;</td>
</tr>
</tbody>
</table>
<h2 id="&#x5E03;&#x5C14;&#x7C7B;&#x578B;"><a name="&#x5E03;&#x5C14;&#x7C7B;&#x578B;" class="anchor-navigation-ex-anchor" href="#&#x5E03;&#x5C14;&#x7C7B;&#x578B;"><i class="fa fa-link" aria-hidden="true"></i></a>1.4. &#x5E03;&#x5C14;&#x7C7B;&#x578B;</h2>
<p>&#x5728;&#x6211;&#x4EEC;&#x65E5;&#x5E38;&#x4FE1;&#x606F;&#x4F20;&#x9012;&#x4E2D;&#xFF0C;&#x9664;&#x4E86;&#x6587;&#x672C;&#x3001;&#x6570;&#x5B57;&#xFF0C;&#x6211;&#x4EEC;&#x5F80;&#x5F80;&#x8FD8;&#x8981;&#x8FDB;&#x884C;&#x5224;&#x65AD;&#xFF0C;&#x4E8E;&#x662F;&#x4E4E;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x6709;&#x4E86;&#x201C;&#x662F;&#x3001;&#x5426;&#x201D;&#xFF0C;&#x201C;&#x786E;&#x5B9A;&#x3001;&#x53D6;&#x6D88;&#x201D;&#xFF0C;&#x800C;&#x8BA1;&#x7B97;&#x673A;&#x5F53;&#x4E2D;&#xFF0C;&#x4E5F;&#x6709;&#x8FD9;&#x4E9B;&#xFF0C;&#x90A3;&#x4E48;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x8BA1;&#x7B97;&#x673A;&#x53EF;&#x4E0D;&#x50CF;&#x6211;&#x4EEC;&#xFF0C;&#x80FD;&#x641E;&#x51FA;&#x90A3;&#x4E48;&#x591A;&#x7684;&#x82B1;&#x6837;&#xFF0C;&#x4F46;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x4E5F;&#x6709;&#x6700;&#x57FA;&#x672C;&#x7684;&#xFF0C;&#x5373;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x8981;&#x4E86;&#x89E3;&#x5230;&#x7684;&#x5E03;&#x5C14;&#x503C;&#x7C7B;&#x578B;&#xFF0C;&#x5373;&#x5E03;&#x5C14;&#x903B;&#x8F91;&#x3002;&#x5C31;&#x5982;&#x540C;&#x6211;&#x4EEC;&#x65E5;&#x5E38;&#x751F;&#x6D3B;&#x4E2D;&#x9047;&#x5230;&#x7684;&#x201C;&#x6760;&#x7CBE;&#x201D;&#x4EEC;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E0D;&#x5C31;&#x8981;&#x4E48;&#x662F;&#xFF0C;&#x8981;&#x4E48;&#x4E0D;&#x662F;&#x561B;&#x3002;&#x5DE7;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E5F;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x6760;&#x7CBE;&#x3002;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x9A82;&#x4EBA;&#x8BF4;&#x6760;&#x7CBE;&#x662F;&#x4E8C;&#x6781;&#x7BA1;&#x601D;&#x7EF4;&#x3002;&#x5DE7;&#x4E86;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x8FD8;&#x771F;&#x5C31;&#x662F;&#x7531;&#x4E8C;&#x6781;&#x7BA1;&#x6F14;&#x5316;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x53EF;&#x662F;&#x4E2A;&#x540D;&#x526F;&#x5176;&#x5B9E;&#x7684;&#x771F;&#xB7;&#x4E8C;&#x6781;&#x7BA1;&#xFF01;&#x90A3;&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x53C8;&#x662F;&#x5982;&#x4F55;&#x8868;&#x8FBE;&#x6211;&#x4EEC;&#x7684;&#x201C;&#x662F;&#x3001;&#x5426;&#x201D;&#xFF0C;&#x201C;&#x597D;&#x3001;&#x574F;&#x201D;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x5E03;&#x5C14;&#x7C7B;&#x578B;&#xFF0C;&#x50CF;&#x524D;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x4E86;&#x89E3;&#x5230;&#x7684;&#x90A3;&#x4E9B;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x4E00;&#x6837;&#xFF0C;&#x53D8;&#x91CF;&#x503C;&#x548C;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x4E4B;&#x95F4;&#xFF0C;&#x5F80;&#x5F80;&#x6709;&#x7740;&#x5BF9;&#x5E94;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x59A8;&#x6765;&#x590D;&#x4E60;&#x4E00;&#x4E0B;</p>
<table>
<thead>
<tr>
<th>&#x503C;&#x5185;&#x5BB9;</th>
<th>&#x5BF9;&#x5E94;&#x7684;&#x53D8;&#x91CF;&#x7C7B;&#x578B;</th>
</tr>
</thead>
<tbody>
<tr>
<td>&#x6574;&#x6570;&#xFF0C;&#x5982;&#xFF1A;1314&#xFF0C;520&#xFF0C;-2021</td>
<td>int&#xFF0C;&#x6574;&#x6570;</td>
</tr>
<tr>
<td>&#x5C0F;&#x6570;&#xFF0C;&#x5982;&#xFF1A;3.1415926&#xFF0C;99.999999</td>
<td>float&#xFF0C;&#x6D6E;&#x70B9;&#x6570;</td>
</tr>
<tr>
<td>&#x5355;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5B57;&#x7B26;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5982;&#xFF1A;&#x6211;&#x7231;&#x4F60;&#x4E09;&#x5343;&#x904D;&#xFF0C;Python</td>
<td>str&#xFF0C;&#x5B57;&#x7B26;&#x4E32;</td>
</tr>
<tr>
<td>&#x90A3;&#x4E48;&#xFF1A;True&#xFF0C;False</td>
<td>&#x8FD9;&#x53C8;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</td>
</tr>
</tbody>
</table>
<p>&#x8FD9;&#x5C31;&#x662F;&#x5E03;&#x5C14;&#xFF08;bool&#xFF09;&#x7C7B;&#x578B;&#xFF0C;&#x5B83;&#x7684;&#x503C;&#x662F;&#x4E24;&#x4E2A;&#x89C4;&#x5B9A;&#x7684;&#x503C;&#xFF0C;&#x5206;&#x522B;&#x4E3A;True&#x548C;False&#xFF0C;&#x548C;&#x6211;&#x4EEC;&#x65E5;&#x5E38;&#x89C1;&#x5230;&#x7684;&#x201C;&#x6760;&#x7CBE;&#x201D;&#x4EEC;&#x4E00;&#x6837;&#xFF0C;&#x5E03;&#x5C14;&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF0C;&#x662F;&#x8981;&#x4E48;True&#xFF0C;&#x8981;&#x4E48;False&#x3002;&#x4E0D;&#x80FD;&#x662F;&#x522B;&#x7684;&#x3002;</p>
<p>&#x542C;&#x8D77;&#x6765;&#x5F88;&#x8FF7;&#x7CCA;&#xFF1F;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x522B;&#x6015;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x6F14;&#x793A;&#x6765;&#x7406;&#x89E3;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x8FD8;&#x662F;&#x4F20;&#x7EDF;&#x827A;&#x80FD;&#xFF0C;&#x5E9F;&#x8BDD;&#x4E0D;&#x591A;&#x8BF4;&#xFF0C;&#x5148;&#x4E0A;&#x4EE3;&#x7801;&#xFF0C;&#x518D;&#x4E0A;&#x56FE;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#xFF0C;&#x8FD9;&#x5C31;&#x8DDF;&#x6211;&#x4EEC;&#x5411;&#x5973;&#x795E;&#x8868;&#x767D;&#x4E00;&#x6837;&#xFF1A;</p>
<pre class="language-"><code class="lang-python"><span class="token keyword">import</span> random

a <span class="token operator">=</span> <span class="token number">0</span>
<span class="token keyword">while</span> a <span class="token operator">&lt;</span> <span class="token number">1</span><span class="token punctuation">:</span>
    biaobai <span class="token operator">=</span> random<span class="token punctuation">.</span>choice<span class="token punctuation">(</span><span class="token punctuation">[</span><span class="token boolean">True</span><span class="token punctuation">,</span> <span class="token boolean">False</span><span class="token punctuation">]</span><span class="token punctuation">)</span>
    b <span class="token operator">=</span> <span class="token builtin">input</span><span class="token punctuation">(</span><span class="token string">&quot;&#x8981;&#x8DDF;&#x5973;&#x795E;&#x8868;&#x767D;&#x5417;&#xFF1F;&#x8981;&#xFF0C;&#x8F93;&#x5165;1&#xFF0C;&#x4E0D;&#x8981;&#x8F93;&#x5165;2&quot;</span><span class="token punctuation">)</span>
    <span class="token keyword">if</span> b <span class="token operator">==</span> <span class="token string">&quot;1&quot;</span><span class="token punctuation">:</span>
        <span class="token keyword">if</span> biaobai <span class="token operator">==</span> <span class="token boolean">True</span><span class="token punctuation">:</span>
            <span class="token keyword">print</span><span class="token punctuation">(</span><span class="token string">&quot;&#x606D;&#x559C;&#x4F60;&#xFF0C;&#x5973;&#x795E;&#x540C;&#x610F;&#x4E86;&#xFF0C;&#x8868;&#x767D;&#x6210;&#x529F;&#xFF01;&#x6492;&#x82B1;&#x1F389;&#x1F389;&#x1F389;&quot;</span><span class="token punctuation">)</span>
            <span class="token keyword">print</span><span class="token punctuation">(</span><span class="token string">&quot;&#x6B64;&#x65F6;&#x53D8;&#x91CF;biaobai&#x7684;&#x503C;&#x4E3A;&#xFF1A;&quot;</span> <span class="token operator">+</span> <span class="token builtin">str</span><span class="token punctuation">(</span>biaobai<span class="token punctuation">)</span><span class="token punctuation">)</span>
        <span class="token keyword">if</span> biaobai <span class="token operator">==</span> <span class="token boolean">False</span><span class="token punctuation">:</span>
            <span class="token keyword">print</span><span class="token punctuation">(</span><span class="token string">&quot;&#x5F88;&#x9057;&#x61BE;&#xFF0C;&#x5973;&#x795E;&#x62D2;&#x7EDD;&#x4E86;&#xFF0C;&#x8868;&#x767D;&#x5931;&#x8D25;&#x1F62D;&#x1F62D;&#x1F62D;&quot;</span><span class="token punctuation">)</span>
            <span class="token keyword">print</span><span class="token punctuation">(</span><span class="token string">&quot;&#x6B64;&#x65F6;&#x53D8;&#x91CF;biaobai&#x7684;&#x503C;&#x4E3A;&#xFF1A;&quot;</span> <span class="token operator">+</span> <span class="token builtin">str</span><span class="token punctuation">(</span>biaobai<span class="token punctuation">)</span><span class="token punctuation">)</span>
    <span class="token keyword">elif</span>  b <span class="token operator">==</span> <span class="token string">&quot;2&quot;</span><span class="token punctuation">:</span>
        <span class="token keyword">print</span><span class="token punctuation">(</span><span class="token string">&quot;&#x6709;&#x75C5;&#x5440;&#xFF0C;&#x4E0D;&#x6765;&#x8868;&#x767D;&#x8FD8;&#x8FD0;&#x884C;&#x4E2A;&#x6BDB;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x795D;&#x5B64;&#x751F;&#xFF01;&quot;</span><span class="token punctuation">)</span>
    <span class="token keyword">else</span><span class="token punctuation">:</span>
        <span class="token keyword">print</span><span class="token punctuation">(</span><span class="token string">&quot;&#x4E0D;&#x8981;&#x7D27;&#x5F20;&#xFF0C;&#x8868;&#x767D;&#x6CA1;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x8BF7;&#x6309;&#x7167;&#x63D0;&#x793A;&#x8F93;&#x5165;&#x1F60A;&quot;</span><span class="token punctuation">)</span>
</code></pre>
<p>&#x4E0A;&#x56FE;&#xFF1A;</p>
<p><img src="../../../assets/Unit01/image-20210703164001569.png" alt="image-20210703164001569"></p>
<p>&#x5C31;&#x50CF;&#x56FE;&#x4E2D;&#x4E00;&#x6837;&#xFF0C;&#x5E03;&#x5C14;&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x8981;&#x4E48;&#x503C;&#x4E3A;True&#xFF0C;&#x8981;&#x4E48;&#x4E3A;False&#x3002;&#x4E00;&#x822C;&#x50CF;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x673A;&#x505A;&#x771F;&#x3001;&#x5047;&#xFF0C;&#x5BF9;&#x3001;&#x9519;&#xFF0C;&#x662F;&#x3001;&#x975E;&#x5224;&#x65AD;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x9700;&#x8981;&#x7528;&#x5230;&#x5B83;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x505A;&#x5224;&#x65AD;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x60F3;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x5E03;&#x5C14;&#x7C7B;&#x578B;&#xFF0C;&#x901A;&#x8FC7;&#x6211;&#x4EEC;&#x7684;&#x5E03;&#x5C14;&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#x6765;&#x8FDB;&#x884C;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#x3002;&#x8FD9;&#x91CC;&#x5148;&#x7B80;&#x5355;&#x7684;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#xFF0C;&#x540E;&#x9762;&#x6211;&#x4EEC;&#x9047;&#x5230;&#x5177;&#x4F53;&#x7684;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#x518D;&#x505A;&#x5177;&#x4F53;&#x7684;&#x8BF4;&#x660E;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x793A;&#x8303;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x4E0D;&#x77E5;&#x5230;&#x5927;&#x5BB6;&#x6709;&#x6CA1;&#x6709;&#x53D1;&#x73B0;&#xFF0C;&#x4E2D;&#x95F4;&#x6709;&#x4E00;&#x53E5;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<pre class="language-"><code class="lang-python"><span class="token keyword">print</span><span class="token punctuation">(</span><span class="token string">&quot;&#x6B64;&#x65F6;&#x53D8;&#x91CF;biaobai&#x7684;&#x503C;&#x4E3A;&#xFF1A;&quot;</span> <span class="token operator">+</span> <span class="token builtin">str</span><span class="token punctuation">(</span>biaobai<span class="token punctuation">)</span><span class="token punctuation">)</span>
</code></pre>
<p>&#x53D8;&#x91CF;&#x88AB;&#x62EC;&#x53F7;&#x62EC;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x524D;&#x9762;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x7C7B;&#x578B;&#x7684;&#x201C;&#x6807;&#x8BC6;&#x7B26;&#x201D;&#x2014;&#x2014;&#x201C;str&#x201D;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8FD9;&#x6837;&#x5462;&#xFF1F;</p>
<p>&#x9996;&#x5148;&#xFF1A;&#x6211;&#x4EEC;&#x8981;&#x77E5;&#x9053;&#x548C;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5F53;print&#x8F93;&#x51FA;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5FC5;&#x987B;&#x4FDD;&#x8BC1;&#x5185;&#x5BB9;&#x5168;&#x90E8;&#x90FD;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x53EA;&#x8981;&#x5176;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x5185;&#x5BB9;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x6211;&#x4EEC;&#x5269;&#x4E0B;&#x5C31;&#x5FC5;&#x987B;&#x90FD;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>
<p>&#x90A3;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5C31;&#x9EBB;&#x70E6;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x53D8;&#x91CF;&#x201C;biaobai&#x201D;&#x662F;&#x201C;bool&#x201D;&#x5E03;&#x5C14;&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#x8981;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;&#x4E0D;&#x8981;&#x7740;&#x6025;&#xFF0C;&#x4E0D;&#x8981;&#x60CA;&#x614C;&#xFF0C;&#x8BE5;&#x6765;&#x7684;&#x603B;&#x4F1A;&#x6765;&#x1F436;&#x72D7;&#x5934;&#x4FDD;&#x547D;&#xFF01;&#x4E0D;&#x8FC7;&#x8BE5;&#x6765;&#x7684;&#x786E;&#x5B9E;&#x6765;&#x4E86;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x5728;Python&#x7684;&#x8BBE;&#x8BA1;&#x8005;&#x90A3;&#x91CC;&#x4E5F;&#x8003;&#x8651;&#x5230;&#x4E86;&#xFF0C;&#x8FD9;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;&#x603B;&#x4E0D;&#x80FD;&#x53EA;&#x8BB8;&#x5DDE;&#x5B98;&#x653E;&#x706B;&#xFF0C;&#x4E0D;&#x8BB8;&#x767E;&#x59D3;&#x70B9;&#x706F;&#x5427;&#xFF1F;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x6211;&#x4EEC;int&#xFF0C;float&#x548C;bool&#xFF0C;&#x90FD;&#x4E0D;&#x914D;&#x88AB;&#x8F93;&#x51FA;&#x4E86;&#x561B;&#xFF1F;&#x90A3;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x867D;&#x7136;&#x662F;&#x771F;&#xB7;&#x4E8C;&#x6781;&#x7BA1;&#xFF0C;&#x53EF;&#x6211;&#x4EEC;&#x4EBA;&#x7C7B;&#x4E0D;&#x662F;&#x5440;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5F53;&#x7136;&#x4E0D;&#x80FD;&#x8FD9;&#x4E48;&#x53CC;&#x6807;&#x3002;int&#x3001;float&#x548C;bool&#x8FD8;&#x662F;&#x4E00;&#x6837;&#x53EF;&#x4EE5;&#x88AB;&#x8F93;&#x51FA;&#x51FA;&#x6765;&#xFF0C;&#x53EA;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7ED9;&#x5B83;&#x53D8;&#x4E00;&#x53D8;&#xFF0C;&#x90A3;&#x4E48;&#x600E;&#x4E48;&#x53D8;&#x5462;&#xFF1F;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5C31;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x4E0B;&#x9762;&#x8981;&#x8BB2;&#x5230;&#x7684;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x4E86;</p>
<h2 id="&#x7C7B;&#x578B;&#x8F6C;&#x6362;"><a name="&#x7C7B;&#x578B;&#x8F6C;&#x6362;" class="anchor-navigation-ex-anchor" href="#&#x7C7B;&#x578B;&#x8F6C;&#x6362;"><i class="fa fa-link" aria-hidden="true"></i></a>1.5. &#x7C7B;&#x578B;&#x8F6C;&#x6362;</h2>
<p>&#x8BA1;&#x7B97;&#x673A;&#x5728;&#x4EBA;&#x7684;&#x52A0;&#x6301;&#x4E0B;&#x867D;&#x7136;&#x5F88;&#x201C;&#x806A;&#x660E;&#x201D;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;&#x4EBA;&#x7C7B;&#x7684;&#x667A;&#x6167;&#x52A0;&#x6301;&#xFF0C;&#x5B83;&#x771F;&#x7684;&#x4E0D;&#x884C;&#xFF0C;&#x5C31;&#x50CF;&#x5728;&#x7528;print&#x8F93;&#x51FA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EA;&#x8981;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x5B83;&#x5C31;&#x5FC5;&#x987B;&#x8981;&#x5168;&#x90FD;&#x7EDF;&#x4E00;&#x79F0;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x539F;&#x56E0;&#x4E5F;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x4E3A;&#x4E86;&#x4E0D;&#x51FA;&#x9519;&#x3002;&#x5B83;&#x6CA1;&#x6211;&#x4EEC;&#x4EBA;&#x806A;&#x660E;&#xFF0C;&#x7C7B;&#x578B;&#x592A;&#x590D;&#x6742;&#xFF0C;&#x5B83;&#x628A;&#x6301;&#x4E0D;&#x4F4F;&#x5440;&#x3002;&#x90A3;&#x522B;&#x7684;&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF0C;&#x8981;&#x60F3;&#x8F93;&#x51FA;or&#x8FDB;&#x4E00;&#x6B65;&#x5904;&#x7406;&#x7684;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x5148;&#x5C06;&#x5176;&#x8F6C;&#x5316;&#x6210;&#x5408;&#x9002;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x5C31;&#x50CF;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x524D;&#x9762;&#x8981;&#x60F3;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x5E03;&#x5C14;&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF0C;&#x5C31;&#x8981;&#x5148;&#x628A;&#x5B83;&#x8F6C;&#x6210;str&#x5B57;&#x7B26;&#x4E32;&#x7C7B;&#x578B;&#x7684;&#x3002;&#x50CF;&#x8FD9;&#x79CD;print&#x8BED;&#x6CD5;&#x8981;&#x6C42;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x3002;&#x90A3;&#x4E48;&#x8FD8;&#x6709;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x4E4B;&#x95F4;&#x7684;&#x8F6C;&#x6362;&#x5462;&#xFF1F;</p>
<p>&#x8FD8;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x4F20;&#x7EDF;&#x827A;&#x80FD;&#xFF1A;&#x5148;&#x4E0A;&#x4EE3;&#x7801;&#xFF0C;&#x518D;&#x4E0A;&#x56FE;</p>
<pre class="language-"><code class="lang-python">xiaomingAge <span class="token operator">=</span> <span class="token builtin">input</span><span class="token punctuation">(</span><span class="token string">&quot;&#x8BF7;&#x8F93;&#x5165;&#x5C0F;&#x660E;&#x7684;&#x5E74;&#x9F84;&quot;</span><span class="token punctuation">)</span>
xiaoqiangAge <span class="token operator">=</span> <span class="token builtin">input</span><span class="token punctuation">(</span><span class="token string">&quot;&#x8BF7;&#x8F93;&#x5165;&#x5C0F;&#x5F3A;&#x7684;&#x5E74;&#x9F84;&quot;</span><span class="token punctuation">)</span>
<span class="token keyword">print</span><span class="token punctuation">(</span><span class="token string">&quot;&#x5C0F;&#x660E;&#x548C;&#x5C0F;&#x5F3A;&#x7684;&#x5E74;&#x9F84;&#x4E4B;&#x548C;&#x4E3A;&#xFF1A;&quot;</span><span class="token punctuation">,</span> xiaomingAge <span class="token operator">+</span> xiaoqiangAge<span class="token punctuation">)</span>
</code></pre>
<p>&#x5927;&#x5BB6;&#x731C;&#x731C;&#x770B;&#x7ED3;&#x679C;&#x4F1A;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#xFF1F;&#x4E0D;&#x5356;&#x5173;&#x5B50;&#xFF0C;&#x4E0A;&#x56FE;&#x4E86;&#xFF1A;</p>
<p><img src="../../../assets/Unit01/image-20210703171724167.png" alt="image-20210703171724167"></p>
<p>&#x60CA;&#x4E0D;&#x60CA;&#x559C;&#xFF0C;&#x610F;&#x4E0D;&#x610F;&#x5916;&#xFF0C;&#x4E24;&#x4E2A;10&#x5C81;&#x76F8;&#x52A0;&#x540E;&#x662F;1010&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x8981;&#x8BF4;&#x4E00;&#x4E0B;&#x4E86;&#xFF0C;input&#xFF0C;&#x4E0D;&#x7BA1;&#x6211;&#x4EEC;&#x8F93;&#x5165;&#x4EC0;&#x4E48;&#xFF0C;&#x5B83;&#x4EEC;&#x4E00;&#x5F8B;&#x4F1A;&#x6309;&#x6211;&#x4EEC;&#x8F93;&#x5165;&#x7684;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x6765;&#x5B58;&#x5982;&#x53D8;&#x91CF;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x4E24;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x7684;10&#xFF0C;&#x76F8;&#x52A0;&#xFF0C;&#x81EA;&#x7136;&#x5C31;&#x662F;&#x5B83;&#x4EEC;&#x5B57;&#x7B26;&#x7684;&#x7D2F;&#x52A0;&#xFF0C;&#x5C31;&#x662F;1010&#x3002;</p>
<p>&#x540C;&#x65F6;&#xFF0C;&#x8FD9;&#x91CC;&#x6559;&#x5927;&#x5BB6;&#x4E00;&#x4E2A;&#x5C0F;&#x6280;&#x5DE7;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x4E0D;&#x786E;&#x5B9A;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x662F;&#x4EC0;&#x4E48;&#x7C7B;&#x578B;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0B;&#x9762;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x83B7;&#x53D6;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#xFF1A;</p>
<pre class="language-"><code class="lang-python"><span class="token keyword">print</span><span class="token punctuation">(</span><span class="token builtin">type</span><span class="token punctuation">(</span>&#x53D8;&#x91CF;&#x540D;<span class="token punctuation">)</span><span class="token punctuation">)</span>
</code></pre>
<p>&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x5230;&#x5B83;&#x7684;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5230;&#x6211;&#x4EEC;&#x95F9;&#x4E86;&#x7B11;&#x8BDD;&#x91CC;&#x7684;&#x4EE3;&#x7801;&#x91CC;&#x8BD5;&#x4E00;&#x8BD5;&#xFF0C;&#x770B;&#x4E00;&#x770B;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x50CF;&#x4E0A;&#x9762;&#x8BF4;&#x7684;&#x90A3;&#x6837;&#xFF1A;</p>
<pre class="language-"><code class="lang-python"><span class="token comment"># &#x51FA;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x95F9;&#x4E86;&#x7B11;&#x8BDD;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;</span>
xiaomingAge <span class="token operator">=</span> <span class="token builtin">input</span><span class="token punctuation">(</span><span class="token string">&quot;&#x8BF7;&#x8F93;&#x5165;&#x5C0F;&#x660E;&#x7684;&#x5E74;&#x9F84;&quot;</span><span class="token punctuation">)</span>
xiaoqiangAge <span class="token operator">=</span> <span class="token builtin">input</span><span class="token punctuation">(</span><span class="token string">&quot;&#x8BF7;&#x8F93;&#x5165;&#x5C0F;&#x5F3A;&#x7684;&#x5E74;&#x9F84;&quot;</span><span class="token punctuation">)</span>
<span class="token keyword">print</span><span class="token punctuation">(</span><span class="token builtin">type</span><span class="token punctuation">(</span>xiaomingAge<span class="token punctuation">)</span><span class="token punctuation">,</span> <span class="token builtin">type</span><span class="token punctuation">(</span>xiaoqiangAge<span class="token punctuation">)</span><span class="token punctuation">)</span> <span class="token comment"># &#x68C0;&#x67E5;&#x4E00;&#x4E0B;&#x662F;&#x4E0D;&#x662F;&#x50CF;&#x6240;&#x8BF4;&#x7684;&#x90A3;&#x6837;&#xFF0C;input&#x7684;&#x5185;&#x5BB9;&#x90FD;&#x662F;&#x5B57;&#x7B26;&#x4E32;</span>
</code></pre>
<p>&#x4E0A;&#x56FE;&#xFF1A;</p>
<p><img src="../../../assets/Unit01/image-20210703172347872.png" alt="image-20210703172347872"></p>
<p>&#x679C;&#x7136;&#xFF0C;&#x548C;&#x6211;&#x4EEC;&#x8BF4;&#x7684;&#x6CA1;&#x9519;&#xFF0C;&#x90A3;&#x8981;&#x8BA9;&#x5B83;&#x4EEC;&#x8FDB;&#x884C;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x7684;&#x52A0;&#x6CD5;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x9700;&#x8981;&#x628A;&#x5B83;&#x4EEC;&#x90FD;&#x8F6C;&#x6210;&#x6570;&#x5B57;&#x7C7B;&#x578B;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x60F3;&#x8981;&#x7684;&#x7ED3;&#x679C;&#x5566;&#xFF0C;&#x90A3;&#x600E;&#x4E48;&#x8F6C;&#x5462;&#xFF1F;&#x5148;&#x4E0A;&#x4EE3;&#x7801;&#xFF0C;&#x518D;&#x4E0A;&#x56FE;&#xFF1A;</p>
<pre class="language-"><code class="lang-python">xiaomingAge <span class="token operator">=</span> <span class="token builtin">input</span><span class="token punctuation">(</span><span class="token string">&quot;&#x8BF7;&#x8F93;&#x5165;&#x5C0F;&#x660E;&#x7684;&#x5E74;&#x9F84;&quot;</span><span class="token punctuation">)</span>
xiaoqiangAge <span class="token operator">=</span> <span class="token builtin">input</span><span class="token punctuation">(</span><span class="token string">&quot;&#x8BF7;&#x8F93;&#x5165;&#x5C0F;&#x5F3A;&#x7684;&#x5E74;&#x9F84;&quot;</span><span class="token punctuation">)</span>
<span class="token keyword">print</span><span class="token punctuation">(</span><span class="token string">&quot;&#x5C0F;&#x660E;&#x548C;&#x5C0F;&#x5F3A;&#x7684;&#x5E74;&#x9F84;&#x4E4B;&#x548C;&#x4E3A;&#xFF1A;&quot;</span><span class="token punctuation">,</span> <span class="token builtin">int</span><span class="token punctuation">(</span>xiaomingAge<span class="token punctuation">)</span> <span class="token operator">+</span> <span class="token builtin">int</span><span class="token punctuation">(</span>xiaoqiangAge<span class="token punctuation">)</span><span class="token punctuation">)</span>
</code></pre>
<p>&#x4E0A;&#x56FE;&#xFF1A;</p>
<p><img src="../../../assets/Unit01/image-20210703172908035.png" alt="image-20210703172908035"></p>
<p>&#x770B;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x4EBA;&#x7C7B;&#x667A;&#x6167;&#x7684;&#x52A0;&#x6301;&#x4E0B;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x5B83;&#x7EC8;&#x4E8E;&#x5B66;&#x4F1A;&#x4E86;&#x600E;&#x4E48;&#x7B97;10+10&#xFF0C;&#x1F436;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x8FD8;&#x4F1A;&#x6709;&#x522B;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x90A3;&#x5C31;&#x7B49;&#x6211;&#x4EEC;&#x5C06;&#x6765;&#x9047;&#x5230;&#xFF0C;&#x518D;&#x5177;&#x4F53;&#x95EE;&#x9898;&#x5177;&#x4F53;&#x5206;&#x6790;&#x5427;&#x3002;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8BB0;&#x4F4F;&#x7684;&#x662F;print&#xFF0C;&#x8F93;&#x51FA;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8981;&#x90FD;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;input&#x5728;&#x8FDB;&#x884C;&#x8F93;&#x5165;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x7684;&#x503C;&#x7C7B;&#x578B;&#x662F;str&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x5F53;&#x53D8;&#x91CF;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x6570;&#x5B66;&#x8FD0;&#x7B97;&#x65F6;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x503C;&#x7C7B;&#x578B;&#x5FC5;&#x987B;&#x662F;&#x6570;&#x5B57;&#x7C7B;&#x578B;&#x3002;&#x4E0B;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x7B80;&#x5355;&#x8BF4;&#x4E00;&#x4E0B;&#xFF0C;&#x8F6C;&#x6362;&#x65F6;&#x7684;&#x64CD;&#x4F5C;&#xFF1A;</p>
<blockquote>
<p>&#x8981;&#x8F6C;&#x6362;&#x7684;&#x76EE;&#x6807;&#x7C7B;&#x578B;&#xFF08;&#x8981;&#x8F6C;&#x6362;&#x7684;&#x53D8;&#x91CF;&#x540D;&#x79F0;&#xFF09;</p>
</blockquote>
<p>&#x5982;&#xFF1A;</p>
<pre class="language-"><code class="lang-python"><span class="token builtin">str</span><span class="token punctuation">(</span>a<span class="token punctuation">)</span>
<span class="token comment"># &#x540C;&#x7406;&#xFF0C;&#x8981;&#x628A;a&#x8F6C;&#x6362;&#x6210;&#x522B;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x7C7B;&#x578B;&#x5C31;&#x6309;&#x7167;&#x4E0A;&#x9762;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#xFF0C;&#x5982;&#x4E0B;&#xFF1A;</span>
<span class="token builtin">int</span><span class="token punctuation">(</span>a<span class="token punctuation">)</span>
<span class="token builtin">float</span><span class="token punctuation">(</span>a<span class="token punctuation">)</span>
</code></pre>
<p>&#x26A0;&#xFE0F;&#x6CE8;&#x610F;&#xFF1A;&#x5728;&#x5B57;&#x7B26;&#x4E32;&#x8F6C;&#x6570;&#x5B57;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x8981;&#x786E;&#x5B9A;&#x5B57;&#x7B26;&#x4E32;&#x91CC;&#x7684;&#x5185;&#x5BB9;&#x7B26;&#x5408;&#x6570;&#x5B57;&#x7C7B;&#x578B;&#x3002;&#x4E0D;&#x8981;&#x628A;&#x6587;&#x5B57;&#x6216;&#x5B57;&#x6BCD;&#x5B57;&#x7B26;&#x4E5F;&#x53BB;&#x8F6C;&#x6570;&#x5B57;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#xFF0C;&#x5C31;&#x662F;&#x53D8;&#x91CF;&#x521D;&#x6B65;&#x7684;&#x5168;&#x90E8;&#x5185;&#x5BB9;&#xFF0C;&#x968F;&#x7740;&#xFF0C;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x7684;&#x6DF1;&#x5165;&#xFF0C;&#x5728;&#x672A;&#x6765;&#x8FD8;&#x4F1A;&#x6709;&#x5176;&#x4ED6;&#x53D8;&#x91CF;&#xFF0C;&#x76EE;&#x524D;&#xFF0C;&#x5148;&#x4EE5;&#x4E0A;&#x9762;&#x7684;&#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x4E3A;&#x4E3B;&#x3002;&#x5927;&#x5BB6;&#x8981;&#x591A;&#x591A;&#x7EC3;&#x4E60;&#x54DF;&#xFF01;&#x52A0;&#x6CB9;&#x9E2D;&#xFF01;</p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; <a href="http://www.jiazhixiang.xyz/" target="_blank">&#x8CC8;&#x8A8C;&#x7FD4;</a> 2021  all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x6587;&#x7AE0;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2021-07-03 23:45:51
</span></footer>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../L4注释的使用/注释的使用.html" class="navigation navigation-prev " aria-label="Previous page: L4注释的使用">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../编码规范、标识符、关键字/L6编码规范、标识符、关键字.md" class="navigation navigation-next " aria-label="Next page: L6编码规范、标识符、关键字">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"L5变量类型初步","level":"1.2.5","depth":2,"next":{"title":"L6编码规范、标识符、关键字","level":"1.2.6","depth":2,"path":"doc/Unit01-初识/编码规范、标识符、关键字/L6编码规范、标识符、关键字.md","ref":"doc/Unit01-初识/编码规范、标识符、关键字/L6编码规范、标识符、关键字.md","articles":[]},"previous":{"title":"L4注释的使用","level":"1.2.4","depth":2,"path":"doc/Unit01-初识/L4注释的使用/注释的使用.md","ref":"doc/Unit01-初识/L4注释的使用/注释的使用.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-lunr","-search","-sharing","-highlight","favicon","yahei","popup","github","autotheme","github-buttons","splitter","tbfed-pagefooter","expandable-chapters","chapter-fold","book-summary-scroll-position-saver","copy-code-button","sharing-plus","advanced-emoji","anchor-navigation-ex","prism","search-plus","livereload"],"root":".","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy <a href='http://www.jiazhixiang.xyz/' target='_blank'>賈誌翔</a> 2021 ","modify_label":"文章修订时间：","modify_format":"YYYY-MM-DD HH:mm:ss"},"chapter-fold":{},"prism":{"css":["prismjs/themes/prism-tomorrow.css"]},"github":{"url":"https://github.com/jiaxiaochu"},"yahei":{},"livereload":{},"book-summary-scroll-position-saver":{},"splitter":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"popup":{},"sitemap-general":{"prefix":"https://jiaxiaochu.gitee.io/myBook/"},"fontsettings":{"theme":"white","family":"sans","size":2},"fontSettings":{"family":"serif","size":2},"sectionx":{"标签":"Show"},"anchor-navigation-ex":{"associatedWithSummary":false,"float":{"floatIcon":"fa fa-navicon","level1Icon":"fa fa-hand-o-right","level2Icon":"fa fa-hand-o-right","level3Icon":"fa fa-hand-o-right","showLevelIcon":false},"mode":"float","multipleH1":true,"pageTop":{"level1Icon":"fa fa-hand-o-right","level2Icon":"fa fa-hand-o-right","level3Icon":"fa fa-hand-o-right","showLevelIcon":false},"printLog":false,"showGoTop":true,"showLevel":true},"favicon":{"shortcut":"assets/images/color_cat.ico","bookmark":"assets/images/color_cat.ico","appleTouch":"assets/images/color_cat.jpg","appleTouchMore":{"120x120":"assets/images/color_cat.jpg","180x180":"assets/images/color_cat.jpg"}},"github-buttons":{"buttons":[{"user":"jiaxiaochu","repo":"python-data-analysis","type":"star","size":"small"}]},"copy-code-button":{},"autotheme":{"night":[20,21,22,23,0,1,2,3,4,5],"sepia":[6,7,8,18,19,19],"white":[9,10,11,12,13,14,15,16,17]},"advanced-emoji":{"embedEmojis":false},"sharing":{"qq":true,"all":["douban","weibo","qzone","qq"],"douban":true,"facebook":false,"weibo":true,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":false,"messenger":false,"line":false,"vk":false,"pocket":false,"google":false,"viber":false,"stumbleupon":false,"qzone":true,"linkedin":false},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":true},"expandable-chapters":{},"search-plus":{}},"theme":"default","author":"賈誌翔","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"吹花小筑工作室","language":"zh-hans","links":{"sidebar":{}},"gitbook":"3.x.x","description":"吹花小筑工作室"},"file":{"path":"doc/Unit01-初识/L5变量类型初步/变量类型初步.md","mtime":"2021-07-03T15:45:51.101Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-07-04T04:42:20.148Z"},"basePath":"../../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../../gitbook/gitbook.js"></script>
    <script src="../../../gitbook/theme.js"></script>
    
        
        <script src="../../../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-autotheme/plugin.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-book-summary-scroll-position-saver/book-summary-scroll-position-saver.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-copy-code-button/toggle.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

